Per [@edwardmedia's comment](https://github.com/hashicorp/terraform-provider-google/issues/8760#issuecomment-805952269): I would be surprised if that provider definition affected anything, I'd assume it would cause the AWS provider to not work but do nothing to the Google one. It's probably worth verifying, though.

Per https://github.com/hashicorp/terraform-provider-google/issues/8715#issuecomment-802919039: The default configuration for the `google` provider will be used! At least, it is for me. I'm using `0.13.4` and not `0.14.5`, admittedly.

---

If the following configuration doesn't work in isolation, there's certainly a provider bug:

```
provider "google" {
  project = "my-test-project"
  region  = "europe-west1"
  zone    = "europe-west1-b"
}

resource "google_storage_bucket" "example" {
  name          = "my-test-bucket"
  location      = "europe-west1"
}
```

I don't receive the same error, though (subbing in my project):

```
rileykarson@rileykarson-macbookpro ~/terraform-test/test-input/gcs-project
$ GOOGLE_PROJECT= terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.example will be created
  + resource "google_storage_bucket" "example" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "my-test-bucket"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_storage_bucket.example: Creating...

Error: googleapi: Error 409: Sorry, that name is not available. Please try a different one., conflict

  on main.tf line 7, in resource "google_storage_bucket" "example":
   7: resource "google_storage_bucket" "example" {
```